RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_pds.c
    switch (pinCfg) {
        case SF_IO_EXT_SF2:
            /* pu/pd/ie config */
            tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_I_SET);
            /* GPIO24~38 [8][5][2] = 0 */
            tmpVal &= ~(0x124);
            BL_WR_REG(PDS_BASE, PDS_GPIO_I_SET, tmpVal);
            break;
        default:
            break;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set MCU0 clock enable
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_MCU0_Clock_Enable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG1);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_REG_MCU1_CLK_EN);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set MCU0 clock disable
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_MCU0_Clock_Disable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG1);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_REG_MCU1_CLK_EN);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set MCU0 reset address
 *
 * @param  addr: address
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_MCU0_Reset_Address(uint32_t addr)
{
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG14, addr);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  enable LP clock
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_LP_Clock_Enable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG0);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_REG_PICO_CLK_EN);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  disable LP clock
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_LP_Clock_Disable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_REG_PICO_CLK_EN);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set LP clock divider
 *
 * @param  div: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_LP_System_CLK_Div(uint8_t div)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG7);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_REG_PICO_DIV, 1);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG7, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG7);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_REG_PICO_DIV, div);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG7, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set LP clock
 *
 * @param  clkFreq: clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type PDS_Set_LP_System_CLK(PDS_LP_SYS_CLK_Type clkFreq)
{
    CHECK_PARAM(IS_PDS_LP_SYS_CLK_TYPE(clkFreq));

    /* do nothing */
    (void)clkFreq;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  reset LP rtc
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Reset_LP_RTC(void)
{
    uint32_t tmpVal = 0;

    /* lp rtc_rst=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG8);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_E902_RTC_RST);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG8, tmpVal);

    /* lp rtc_rst=1 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG8);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_E902_RTC_RST);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG8, tmpVal);

    /* lp rtc_rst=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG8);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_E902_RTC_RST);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG8, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set LP rtc clock
 *
 * @param  enable: ENABLE or DISABLE
 * @param  div: clock div
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_LP_RTC_CLK(uint8_t enable, uint16_t div)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM((div <= 0x3FF));

    /* lp rtc_en=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG8);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_E902_RTC_EN);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG8, tmpVal);

    /* lp rtc_div=div */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG8);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_E902_RTC_DIV, div);
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG8, tmpVal);

    /* lp rtc_en=0/1 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG8);
    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, PDS_E902_RTC_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_E902_RTC_EN);
    }
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG8, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set LP reset address
 *
 * @param  addr: address
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Set_LP_Reset_Address(uint32_t addr)
{
    BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG13, addr);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get mm system power state
 *
 * @param  None
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type ATTR_CLOCK_SECTION PDS_Get_MM_System_Power_On_State(void)
{
    uint32_t tmpVal = 0;
    uint32_t pwrOff = 0;
    uint32_t isoEn = 0;
    uint32_t gateClk = 0;
    uint32_t memStby = 0;
    uint32_t pdsRst = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    pwrOff = BL_GET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_FORCE_MM_PWR_OFF);
    isoEn = BL_GET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_FORCE_MM_ISO_EN);
    gateClk = BL_GET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_FORCE_MM_GATE_CLK);
    memStby = BL_GET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_FORCE_MM_MEM_STBY);
    pdsRst = BL_GET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_FORCE_MM_PDS_RST);

    if (pwrOff || isoEn || gateClk || memStby || pdsRst) {
        /* mm system power off */
        return RESET;
    }

    /* mm system power on */
    return SET;
}

/****************************************************************************/ /**
 * @brief  power on mm system
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION PDS_Power_On_MM_System(void)
{
    uint32_t tmpVal = 0;

    /* mm_pwr_off=0, [1]=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_FORCE_MM_PWR_OFF);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* wait > 30us */
    arch_delay_us(45);

    /* mm_iso_en=0, [5]=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_FORCE_MM_ISO_EN);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* mm_gate_clk=0, [17]=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_FORCE_MM_GATE_CLK);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* mm_stby=0, [13]=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_FORCE_MM_MEM_STBY);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* mm_reset=0, [9]=0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_FORCE_MM_PDS_RST);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable power down sleep
 *
 * @param  cfg: power down sleep configuration 1
 * @param  cfg4: power down sleep configuration 2
 * @param  pdsSleepCnt: power down sleep count cycle
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Enable(PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt)
{
    uint32_t tmpVal = 0;
    /* PDS sleep time 1~PDS_WARMUP_LATENCY_CNT <=> error */
    /* PDS sleep time >PDS_WARMUP_LATENCY_CNT <=> correct */
    if ((pdsSleepCnt) && (pdsSleepCnt <= PDS_WARMUP_LATENCY_CNT)) {
        return ERROR;
    } else if (pdsSleepCnt > PDS_WARMUP_LATENCY_CNT) {
        BL_WR_REG(PDS_BASE, PDS_TIME1, pdsSleepCnt - PDS_WARMUP_LATENCY_CNT);
    } else {
        /* PDS sleep time 0 ,means mask pds_timer wakeup  */
    }

    /* PDS_CTL4 config */
    BL_WR_REG(PDS_BASE, PDS_CTL4, *(uint32_t *)cfg4);

    /* PDS_CTL config */
    if (cfg->pdsStart) {
        /* clear pds int */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
        tmpVal = BL_SET_REG_BIT(tmpVal, PDS_CR_PDS_INT_CLR);
        BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

        tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
        tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_INT_CLR);
        BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

        BL_WR_REG(PDS_BASE, PDS_CTL, (*(uint32_t *)cfg & ~(1 << 0)));
        BL_WR_REG(PDS_BASE, PDS_CTL, (*(uint32_t *)cfg | (1 << 0)));
    } else {
        BL_WR_REG(PDS_BASE, PDS_CTL, *(uint32_t *)cfg);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  power down sleep force configure
 *
 * @param  cfg2: power down sleep force configuration 1
 * @param  cfg3: power down sleep force configuration 2
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Force_Config(PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3, PDS_CTL5_Type *cfg5)
{
    /* PDS_CTL2 config */
    BL_WR_REG(PDS_BASE, PDS_CTL2, *(uint32_t *)cfg2);

    /* PDS_CTL3 config */
    BL_WR_REG(PDS_BASE, PDS_CTL3, *(uint32_t *)cfg3);

    /* PDS_CTL5 config */
    BL_WR_REG(PDS_BASE, PDS_CTL5, *(uint32_t *)cfg5);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  power down sleep ram configure
 *
 * @param  ocramCfg: power down sleep force ocram configuration
 * @param  wramCfg: power down sleep force wram configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_RAM_Config(PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg)
{
    if ((NULL == ram1Cfg) || (NULL == ram2Cfg)) {
        return ERROR;
    }

    BL_WR_REG(PDS_BASE, PDS_RAM1, *(uint32_t *)ram1Cfg);
    BL_WR_REG(PDS_BASE, PDS_RAM2, *(uint32_t *)ram2Cfg);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  power down sleep force configure
 *
 * @param  defaultLvCfg: power down sleep default level configuration
 * @param  ramCfg: ram configuration
 * @param  pdsSleepCnt: power down sleep time count
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Default_Level_Config(PDS_DEFAULT_LV_CFG_Type *defaultLvCfg,
                                                      PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg,
                                                      uint32_t pdsSleepCnt)
{
    /* RAM config need fix after ECO */
    PDS_RAM_Config(ram1Cfg, ram2Cfg);
    PDS_Force_Config((PDS_CTL2_Type *)&(defaultLvCfg->pdsCtl2), (PDS_CTL3_Type *)&(defaultLvCfg->pdsCtl3), (PDS_CTL5_Type *)&(defaultLvCfg->pdsCtl5));
    PDS_Enable((PDS_CTL_Type *)&(defaultLvCfg->pdsCtl), (PDS_CTL4_Type *)&(defaultLvCfg->pdsCtl4), pdsSleepCnt);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  power down sleep int mask
 *
 * @param  intType: PDS int type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type PDS_IntMask(PDS_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
    if (intMask != UNMASK) {
        tmpVal = tmpVal | (1 << (intType + PDS_INT_MASK_BIT_OFFSET));
    } else {
        tmpVal = tmpVal & ~(1 << (intType + PDS_INT_MASK_BIT_OFFSET));
    }
    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get power down sleep int status
 *
 * @param  intType: PDS int type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type PDS_Get_IntStatus(PDS_INT_Type intType)
{
    return (BL_RD_REG(PDS_BASE, PDS_INT) & (1 << intType)) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  clear power down sleep int status
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_IntClear(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_INT_CLR);
    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_CR_PDS_INT_CLR);
    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_INT_CLR);
    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Install PDS interrupt callback function
 *
 * @param  intType: PDS int type
 * @param  cbFun: cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
BL_Err_Type PDS_Int_Callback_Install(PDS_INT_Type intType, intCallback_Type *cbFun)
{
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(PDS_WAKEUP_IRQn, PDS_WAKEUP_IRQHandler);
#endif

